Case III/S3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.1;
        smoother         GaussSeidel;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    epsilon
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p               1e-3;
        U               1e-4;
        "(k|epsilon)"   1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        epsilon         0.7;
    }
}

cache
{
    grad(U);
}

actuatorDisk1
{
    interiorRadius        1.5;
    exteriorRadius        63;
    density               1.225;
    startPoint            (#calc "-6.3*1+-2*126" #calc "-6.3*0+-4*126" 90);
    endPoint              (#calc "6.3*1+-2*126" #calc "6.3*0+-4*126" 90);
}

actuatorDisk2
{
    interiorRadius        1.5;
    exteriorRadius        63;
    density               1.225;
    startPoint            (#calc "-6.3*1+3*126" #calc "-6.3*0+0*126" 90);
    endPoint              (#calc "6.3*1+3*126" #calc "6.3*0+0*126" 90);
}

actuatorDisk3
{
    interiorRadius        1.5;
    exteriorRadius        63;
    density               1.225;
    startPoint            (#calc "-6.3*1+2*126" #calc "-6.3*0+-3*126" 90);
    endPoint              (#calc "6.3*1+2*126" #calc "6.3*0+-3*126" 90);
}

actuatorDisk4
{
    interiorRadius        1.5;
    exteriorRadius        63;
    density               1.225;
    startPoint            (#calc "-6.3*1+0*126" #calc "-6.3*0+1*126" 90);
    endPoint              (#calc "6.3*1+0*126" #calc "6.3*0+1*126" 90);
}

actuatorDisk5
{
    interiorRadius        1.5;
    exteriorRadius        63;
    density               1.225;
    startPoint            (#calc "-6.3*1+-4*126" #calc "-6.3*0+2*126" 90);
    endPoint              (#calc "6.3*1+-4*126" #calc "6.3*0+2*126" 90);
}

actuatorDisk6
{
    interiorRadius        1.5;
    exteriorRadius        63;
    density               1.225;
    startPoint            (#calc "-6.3*1+-3*126" #calc "-6.3*0+-1*126" 90);
    endPoint              (#calc "6.3*1+-3*126" #calc "6.3*0+-1*126" 90);
}

actuatorDisk7
{
    interiorRadius        1.5;
    exteriorRadius        63;
    density               1.225;
    startPoint            (#calc "-6.3*1+1*126" #calc "-6.3*0+4*126" 90);
    endPoint              (#calc "6.3*1+1*126" #calc "6.3*0+4*126" 90);
}

actuatorDisk8
{
    interiorRadius        1.5;
    exteriorRadius        63;
    density               1.225;
    startPoint            (#calc "-6.3*1+4*126" #calc "-6.3*0+3*126" 90);
    endPoint              (#calc "6.3*1+4*126" #calc "6.3*0+3*126" 90);
}


// ************************************************************************* //
